tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap 'neovim/neovim'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'git'
brew 'tmux'
brew 'httpie'

# configuration
brew 'mackup'

# utils
cask 'iterm2'
cask 'raycast'
brew 'fish'
cask 'coconutbattery'
cask 'xquartz' # for gui via docker
cask 'remarkable' 
cask 'backblaze' # Backup
cask 'appcleaner'
# cask 'contexts' # Alt-Tab replacement # Doesnt work on M1

# chat
cask 'discord'
cask 'discord-canary'
cask 'zoom'
cask 'signal'
cask 'telegram'
mas 'whatsapp', id: 1147396723
mas 'Slack', id: 803453959

# development
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
brew 'asdf' # Version manager
cask 'docker'
cask 'tower'
cask 'kaleidoscope'
brew 'nvim'
brew 'difftastic'
brew 'caddy'
cask 'boop' # Dev help tool
brew 'mkcert' # Cert tool
cask "medis" # Redis client 
brew 'viddy' # CLI Watch tool met diffs en history
 
# php requirements
brew 'gmp' 
brew 'libsodium'
brew 'imagemagick'
brew 'bison'
brew 're2c'
brew 'pkg-config'
brew 'libgd'
brew 'libiconv'
brew 'icu4c'
brew 'oniguruma'
brew 'postgresql' 
brew 'bzip2' 
brew 'readline' 
brew 'libedit' 
brew 'tidy-html5' 
brew 'openssl' 
brew 'libzip'
brew 'libpq'

# nodejs requirements
brew 'vips'

# security
cask '1password'
cask '1password-cli'
cask 'micro-snitch'
cask 'little-snitch'
brew 'smimesign' # s/mime signing

# media
cask 'vlc'

# browsers
cask 'firefox'
cask 'microsoft-edge'
cask 'google-chrome'

# data
cask 'onedrive'
cask 'hazel'

# Shop
# cask 'setapp'
brew 'mas'

# Apps
mas 'Fantastical', id: 975937182
mas 'Cardhop', id: 1290358394
# mas 'Timery', id: 1425368544 # No longer use Toggl
mas 'DaisyDisk', id: 411643860
cask 'obsidian'
# cask 'fmail' # Fastmail wrapper
# cask 'toggl-track' # No longer use Toggl
# cask 'soulver' # Doesnt work

# Office
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Word', id: 462054704
mas 'Brother iPrint&Scan', id: 1193539993
mas 'Brother P-touch Editor', id: 1453365242

# Safari Plugins
mas 'Save to Raindrop.io', id:1549370672
mas 'LanguageTool', id: 1534275760

# Design
mas 'Affinity Photo', id: 824183456
mas 'Affinity Designer', id: 824171161
cask 'affinity-publisher'
mas 'xScope', id: 889428659
mas 'Pixelmator Pro', id: 1289583905
cask 'adobe-creative-cloud'
cask 'ogdesign-eagle' # eagle.cool

# Security
mas 'Yubico Authenticator', id: 1497506650

# Quicklook
brew 'qlcolorcode'
brew 'quicklook-json'
brew 'qlstephen' # Special files like README
cask 'qlmarkdown'