tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/cask-fonts"
tap 'neovim/neovim'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'git'
brew 'tmux'
brew 'httpie'

# configuration
brew 'mackup'

# utils
cask 'iterm2'
cask 'raycast'
brew 'fish'
cask 'coconutbattery'
cask 'xquartz' # for gui via docker
cask 'remarkable' 
cask 'backblaze' # Backup
cask 'appcleaner'

# chat
cask 'discord'
cask 'discord-canary'
cask 'zoom'
mas 'whatsapp', id: 1147396723
mas 'Slack', id: 803453959

# development
cask 'visual-studio-code'
cask 'jetbrains-toolbox'
brew 'asdf' # Version manager
cask 'docker'
cask 'tower'
cask 'kaleidoscope'
brew 'nvim'

# security
cask '1password'
cask '1password-cli'
cask 'micro-snitch'
cask 'little-snitch'
brew 'smimesign' # s/mime signing

# media
cask 'vlc'

# browsers
cask 'firefox'
cask 'microsoft-edge'
cask 'google-chrome'

# data
cask 'onedrive'
cask 'hazel'

# Shop
# cask 'setapp'
brew 'mas'

# Apps
mas 'Fantastical', id: 975937182
mas 'Cardhop', id: 1290358394
mas 'Timery', id: 1425368544
mas 'DaisyDisk', id: 411643860
cask 'obsidian'
cask 'toggl-track'

# Office
mas 'Microsoft Excel', id: 462058435
mas 'Microsoft Word', id: 462054704

# Design
mas 'Affinity Photo', id: 824183456
mas 'Affinity Designer', id: 824171161
mas 'xScope', id: 889428659
mas 'Pixelmator Pro', id: 1289583905
cask 'adobe-creative-cloud'
cask 'ogdesign-eagle' # eagle.cool
